# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
# https://drive.google.com/file/d/1k0QZvlSKnwu8dVKrrEl6VHi6BsBvwps6/view?usp=sharing
alfavit = ' abcdefghijklmnopqrstuvwxyz'
print(len(alfavit))
num = int(input('Введите номер буквы num : '))
print(alfavit[num])
